In [73]:
#Primeiras operaçoes e localizando registros por loc e iloc

In [1]:
import pandas as pd

# Series

In [2]:
#Criando uma séria e especificando os índices 
Obj = pd.Series([8, 16, 24, 32, 40, 48, 56, 64, 72, 80], index = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'])

In [3]:
Obj

1      8
2     16
3     24
4     32
5     40
6     48
7     56
8     64
9     72
10    80
dtype: int64

In [4]:
Obj.values

array([ 8, 16, 24, 32, 40, 48, 56, 64, 72, 80], dtype=int64)

In [5]:
Obj.index

Index(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'], dtype='object')

In [9]:
Obj[Obj > 30]

4     32
5     40
6     48
7     56
8     64
9     72
10    80
dtype: int64

In [11]:
Obj['7']

56

In [12]:
'2' in Obj

True

In [15]:
dict = {'João' : 5200, 'Maria': 7000, 'José': 10000, 'Cleito': 3000}

In [17]:
#Criando uma série passando um dicionário como parâmetro
Obj1 = pd.Series(dict)

In [18]:
Obj1

João       5200
Maria      7000
José      10000
Cleito     3000
dtype: int64

# Dataframes

In [26]:
data = {'Estado': ['Santa Catarina', 'Paraná', 'Goiás', 'Bahia', 'Minas Gerais'], 
        'Ano': [2002, 2003, 2004, 2005, 2006], 
        'População': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [28]:
frame = pd.DataFrame(data)

In [29]:
frame

           Estado   Ano  População
0  Santa Catarina  2002        1.5
1          Paraná  2003        1.7
2           Goiás  2004        3.6
3           Bahia  2005        2.4
4    Minas Gerais  2006        2.9

In [30]:
type(frame)

pandas.core.frame.DataFrame

In [33]:
# Criando outro dataframe com os mesmo dados anteriores mas adicionando uma coluna
frame2 = pd.DataFrame(data, columns = ['Ano', 'Estado', 'População', 'Débito'], 
                   index = ['um', 'dois', 'três', 'quatro', 'cinco'])

In [34]:
frame2

         Ano          Estado  População Débito
um      2002  Santa Catarina        1.5    NaN
dois    2003          Paraná        1.7    NaN
três    2004           Goiás        3.6    NaN
quatro  2005           Bahia        2.4    NaN
cinco   2006    Minas Gerais        2.9    NaN

In [35]:
#Imprimindo apeenas uma coluna
frame2['Ano']

um        2002
dois      2003
três      2004
quatro    2005
cinco     2006
Name: Ano, dtype: int64

In [36]:
frame2.index

Index(['um', 'dois', 'três', 'quatro', 'cinco'], dtype='object')

In [37]:
frame2.columns

Index(['Ano', 'Estado', 'População', 'Débito'], dtype='object')

In [38]:
frame2.values

array([[2002, 'Santa Catarina', 1.5, nan],
       [2003, 'Paraná', 1.7, nan],
       [2004, 'Goiás', 3.6, nan],
       [2005, 'Bahia', 2.4, nan],
       [2006, 'Minas Gerais', 2.9, nan]], dtype=object)

In [39]:
frame2.dtypes

Ano            int64
Estado        object
População    float64
Débito        object
dtype: object

In [40]:
frame2[:1]

     Ano          Estado  População Débito
um  2002  Santa Catarina        1.5    NaN

# Usando numpy e pandas

In [41]:
# Importando o NumPy
import numpy as np

In [43]:
# Usando o NumPy para alimentar uma das colunas do dataframe
frame2['Débito'] = np.arange(5.)

In [44]:
frame2

         Ano          Estado  População  Débito
um      2002  Santa Catarina        1.5     0.0
dois    2003          Paraná        1.7     1.0
três    2004           Goiás        3.6     2.0
quatro  2005           Bahia        2.4     3.0
cinco   2006    Minas Gerais        2.9     4.0

In [46]:
#Resumo do DataFrame
frame2.describe()

               Ano  População    Débito
count     5.000000   5.000000  5.000000
mean   2004.000000   2.420000  2.000000
std       1.581139   0.864292  1.581139
min    2002.000000   1.500000  0.000000
25%    2003.000000   1.700000  1.000000
50%    2004.000000   2.400000  2.000000
75%    2005.000000   2.900000  3.000000
max    2006.000000   3.600000  4.000000

In [47]:
frame2['dois':'quatro']

         Ano  Estado  População  Débito
dois    2003  Paraná        1.7     1.0
três    2004   Goiás        3.6     2.0
quatro  2005   Bahia        2.4     3.0

In [48]:
# frame2 < 3
frame2[frame2['População'] < 3]

         Ano          Estado  População  Débito
um      2002  Santa Catarina        1.5     0.0
dois    2003          Paraná        1.7     1.0
quatro  2005           Bahia        2.4     3.0
cinco   2006    Minas Gerais        2.9     4.0

# Localizando Registros Dentro do Dataframe

In [49]:
frame2.loc['quatro']

Ano           2005
Estado       Bahia
População      2.4
Débito         3.0
Name: quatro, dtype: object

In [50]:
frame2.iloc[2]

Ano           2004
Estado       Goiás
População      3.6
Débito         2.0
Name: três, dtype: object

In [51]:
# Criando um dicionário
df2 = {'Dias':[1, 2, 3, 4, 5, 6, 7], 
        'Visitantes':[45, 23, 67, 78, 23, 12, 14], 
        'Taxas':[11, 22, 33, 44, 55, 66, 77]}

In [53]:
df3 = pd.DataFrame(df2)

In [54]:
df3.head()

   Dias  Visitantes  Taxas
0     1          45     11
1     2          23     22
2     3          67     33
3     4          78     44
4     5          23     55

In [55]:
# Visualizando uma coluna  index
print(df3.set_index('Dias'))

      Visitantes  Taxas
Dias
1             45     11
2             23     22
3             67     33
4             78     44
5             23     55
6             12     66
7             14     77

In [56]:
df3.head()

   Dias  Visitantes  Taxas
0     1          45     11
1     2          23     22
2     3          67     33
3     4          78     44
4     5          23     55

In [59]:
print(df3['Visitantes'])

0    45
1    23
2    67
3    78
4    23
5    12
6    14
Name: Visitantes, dtype: int64

In [62]:
print(df3[['Visitantes', 'Taxas']])

   Visitantes  Taxas
0          45     11
1          23     22
2          67     33
3          78     44
4          23     55
5          12     66
6          14     77

In [66]:
df3.mean()

Dias           4.000000
Visitantes    37.428571
Taxas         44.000000
dtype: float64

In [67]:
# Merge de Dataframes
left = pd.DataFrame({'chave': ['chave1', 'chave2'], 'coluna1': [1, 2]})
right = pd.DataFrame({'chave': ['chave1', 'chave2'], 'coluna2': [4, 5]})
pd.merge(left, right, on='chave')

    chave  coluna1  coluna2
0  chave1        1        4
1  chave2        2        5

In [68]:
# Adicionando um elemento ao Dataframe
df4 = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [69]:
df4

          A         B         C         D
0  0.322970  1.526066  0.230905 -1.813577
1 -1.400006  0.674239  0.337966 -0.115231
2  0.447120  0.271343  0.575157 -2.177385
3 -0.733408  0.920131 -0.142452 -1.739268
4  0.755226 -0.350484  0.157399 -0.041998
5 -1.557062 -0.107428 -1.488024  0.416520
6 -0.495945  1.618692 -0.404424 -0.130156
7 -1.749319 -1.501842  2.105272  1.497285

In [70]:
s = df4.iloc[3]

In [72]:
# Adicionando um elemento ao Dataframe
df4.append(s, ignore_index=True)

          A         B         C         D
0  0.322970  1.526066  0.230905 -1.813577
1 -1.400006  0.674239  0.337966 -0.115231
2  0.447120  0.271343  0.575157 -2.177385
3 -0.733408  0.920131 -0.142452 -1.739268
4  0.755226 -0.350484  0.157399 -0.041998
5 -1.557062 -0.107428 -1.488024  0.416520
6 -0.495945  1.618692 -0.404424 -0.130156
7 -1.749319 -1.501842  2.105272  1.497285
8 -0.733408  0.920131 -0.142452 -1.739268